{
  "createdAt": 1654770010542,
  "updatedAt": 1654856871492,
  "thumbnail": "https://storage.googleapis.com/picboi-39298.appspot.com/final/YBTGdXPL_1000x800",
  "category": [
    "user",
    "strategy",
    "sentre",
    "moon map",
    "acceleration era"
  ],
  "en": {
    "contents": "The first era ‘Foundation’ has officially ended with Sentre Protocol’s full release of its essential functions, namely Sen LP, Sen Swap, Sen Farming and Sen Assets. These <em>fantastic four</em> have covered all basic needs of an investor on the DeFi market. Now, to further build the Solana community, Sentre Protocol will be unlocking its second era called ‘Acceleration’.\n<h1>The Vision</h1>\n<p>The vision of this era is that Sentre Protocol will become <strong>the best Acceleration Platform for Solana projects</strong>.</p>\n<p>Sentre Protocol will be the safenet for rising stars on Solana, providing what these projects need to become strong, independent and popular products loved by the community. Then, by achieving this status, the final vision of the DApp Store will naturally come true for Sentre Protocol.</p>\n<h1>The Moon Map</h1>\n<img style=\"max-width:1024px;width:100%;display:block;margin:auto;\" src=\"https://storage.googleapis.com/picboi-39298.appspot.com/final/YBTGdXPL_1000x800\" alt=“moonmap”/>\n</br>\n<p>Our updated roadmap will be focusing on making this vision a reality over three eras.</p>\n<h2>The Foundation</h2>\n<p>The <strong>‘Foundation’</strong> Era started back in late 2020 with the birth of our four fundamental pillars for users. Invest for profit on Sen LP, trade with less fees on Sen Swap, optimize liquidity on Sen Farming, and manage your wealth on Sen Assets.</p>\n<p>Along with the four pillars, Sentre developed Senhub as the core product for developers. Get free knowledge from Sen Academy, use available liquidity on the ecosystem, integrate your DApp on Sen Store, and have quality Sentizens use your DApps everyday. This era ended with the full release of all above functions.</p>\n<h2>The Acceleration</h2>\n<p>Moving forward, we’re now that the <strong>‘Acceleration’</strong> Era. This era starts in 2022 with the anticipated birth of The Suite - A collection of five solutions to aching problems that Solana projects are trying to solve. You will find the answers on how to leverage your funds, increase your TVL, save time and fees on your marketing activities, manage your project in a true decentralized fashion, and keep your private transactions from privy eyes on the blockchain.</p>\n<p>Coupled with our new business model and refreshed token utilities, Sentre Protocol aims to become <strong>the best Acceleration Platform for Solana projects</strong> - helping small projects grow the way we have always been doing since even before the Foundation.</p>\n<h2>The DApp Store</h2>\n<p>And last but not least, the <strong>‘DApp Store’</strong> Era. We will see the bloom of hundreds of DApps integrated into Senhub. By the time we reach this, Sentre Protocol will have become the true <strong>DApp Store for all things Solana</strong> - be it DeFi, GameFi, or PriFi products.</p>\n<p>Play your game, earn your tokens or NFTs, then trade with less fees or farm for profit on the same platform. Cover your sensitive transactions from privy eyes if you need. Participate in shaping the future of the Sentre ecosystem through your own customized DAO. Everything is in your hands - our community of devoted and talented Sentizens, from users to developers.</p>",
    "title": "Sentre’s Moon Map Break-down"
  },
  "vn": {
    "contents": "<p>Kỷ nguyên ‘Khởi Đầu’ đã chính thức kết thúc với bản ra mắt chính thức của bốn tính năng cốt lõi trên Sentre Protocol mang tên Sen LP, Sen Swap, Sen Farming và Sen Assets. <em>‘Bộ tứ siêu đẳng’</em> này đã đáp ứng toàn bộ nhu cầu cơ bản của một nhà đầu tư trên thị trường DeFi. Giờ đây, để xây dựng cộng đồng Solana lớn mạnh hơn nữa, Sentre Protocol sẽ khởi động kỷ nguyên thứ hai của mình mang tên ‘Bứt Phá’.</p>\n<h1>Tầm nhìn</h1>\n<p>Tầm nhìn của kỷ nguyên này chính là Sentre Protocol sẽ trở thành <strong>Nền tảng Bứt phá tốt nhất cho các dự án Solana</strong>.</p>\n<p>Sentre Protocol sẽ trở thành safenet cho những ‘ngôi sao xu hướng’ trên hệ sinh thái Solana, cung cấp những gì các dự án này cần để trở thành những sản phẩm mạnh mẽ, độc lập và phổ biến, được cộng đồng yêu thích. Thông qua việc chinh phục mục tiêu này, Sentre Protocol sẽ tiến bước gần hơn tới tầm nhìn sau cùng: <b>trở thành nền tảng DApp Store cho mọi thứ về Solana.</b></p>\n<h1>Moon Map</h1>\n<img style=\"max-width:1024px;width:100%;display:block;margin:auto;\" src=\"https://storage.googleapis.com/picboi-39298.appspot.com/final/IRt1xocA_1000x800\" alt=“moonmap”/>\n</br>\n<p>Nhằm biến tầm nhìn “trở thành DApp Store đầu tiên trên Solana” thành hiện thực, Sentre Protocol quyết định cập nhật chiến lược và kế hoạch thực hiện của mình để đồng bộ hoá với thị trường:</p>\n<h2>Kỷ nguyên ‘Khởi Đầu’</h2>\n<p>Kỷ nguyên <strong>‘Khởi Đầu’</strong> được khởi động từ cuối năm 2020 với sự ra đời của bốn sản phẩm cốt lõi cho người dùng. Đầu tư sinh lời với Sen LP, giao dịch phí thấp trên Sen Swap, tối ưu thanh khoản bằng Sen Farming, và quản lý tài sản thông qua Sen Assets.</p>\n<p>Cùng với bốn sản phẩm cốt lõi trên, Sentre đã phát triển Senhub với mindset tập trung vào developer. Thu nạp kiến thức miễn phí trên Sen Academy, tận dụng thanh khoản có sẵn trên hệ sinh thái, tích hợp DApp lên Sen Store, và có người dùng Sentizen chất lượng sử dụng DApp của bạn mỗi ngày. Kỷ nguyên này đã kết thúc với sự ra mắt đầy đủ của tất cả các tính năng trên.</p>\n<h2>Kỷ nguyên ‘Bứt Phá’</h2>\n<p>Tiến về phía trước, giờ chúng ta đang ở kỷ nguyên <strong>‘Bứt Phá’</strong>. Kỷ nguyên này bắt đầu từ 2022 với màn ra mắt dự kiến của Sen Suite - Bộ sưu tập năm giải pháp cho những vấn đề nhức nhối của dự án trên Solana. Bạn sẽ tìm được câu trả lời cho những câu hỏi như làm thế nào để tạo đòn bẩy với số vốn hiện có, làm thế nào để tăng TVL, tiết kiệm thời gian và chi phí trong các hoạt động marketing, quản lý dự án theo cơ chế phi tập trung, và bảo mật các giao dịch riêng tư trên mạng lưới blockchain.</p>\n<p>Kết hợp với mô hình kinh doanh và token utility hoàn toàn mới, Sentre Protocol đặt mục tiêu trở thành <strong>Nền tảng Bứt Phá tốt nhất cho các dự án trên hệ sinh thái Solana</strong> - giúp các dự án nhỏ phát triển theo cách chúng tôi vẫn luôn làm, ngay từ trước kỷ nguyên Khởi Đầu.</p>\n<h2>Kỷ nguyên ‘DApp Store’</h2>\n<p>Và cuối cùng là kỷ nguyên <strong>‘DApp Store’</strong>. Kỷ nguyên này sẽ cho thấy sự nở rộ của hàng trăm DApp được tích hợp trên Senhub. Tới thời điểm “mở khoá” kỷ nguyên này, Sentre Protocol sẽ trở thành <b>DApp Store thực sự dành riêng cho mọi app trên Solana</b> - từ sản phẩm DeFi, GameFi đến PriFi.</p>\n<p>Chơi game, kiếm token hay NFT, rồi giao dịch phí thấp hoặc farm sinh lời, tất cả trên cùng một nền tảng. Giấu các giao dịch nhạy cảm trên mạng lưới blockchain nếu bạn cần. Tham gia vào quá trình định hình tương lai của hệ sinh thái Sentre thông qua mô hình DAO do bạn tự tay tuỳ chỉnh. Mọi thứ đều nằm trong tầm tay bạn - cộng đồng Sentizen tâm huyết và tài năng của chúng tôi, từ người dùng đến lập trình viên.</p>",
    "title": "\"Giải mã\" Moon Map của Sentre Protocol"
  },
  "id": "205157171593"
}