{
  "createdAt": 1655363737387,
  "updatedAt": 1655364361150,
  "thumbnail": "https://storage.googleapis.com/picboi-39298.appspot.com/final/2DC29kqt_1000x800",
  "category": [
    "sentre",
    "user",
    "acceleration era",
    "sen suite",
    "lightning tunnel"
  ],
  "en": {
    "contents": "Almost all blockchain projects have done an “airdrop.” Therefore, calling it a universal form of reward event in the blockchain world would not be an exaggeration.\n\n<p>However, while many of these airdrops attracted numerous participants, they also cost an increasing amount of time and fee spent signing for the organizers, not to mention the many possible errors during transactions.</p>\n\n<p>To tackle these problems and create a smooth experience for both the organizers and their participants, Sentre Protocol releases Lightning Tunnel - A bulk transaction tool for airdrops.</p>\n</br>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/7NublM5TjntQfc0ShX-WfYb-ZsG6h8MgxMZ8YemKpnesuyu-FMNzi7jyyNfpLhPdu9Bqee-cIT9bVgsH3fymgoiL-bMLWg3rIwvYQXuWhFhHeLzu17-9rgYmMjAfEIflUZRxm8Sl9Mu1O6e7lw\" alt=\"\"/></figure>\n\n<h1>What’s special about Lightning Tunnel</h1>\n\n<p>Stop spending hundreds of dollars on transaction fees for an airdrop, then an afternoon clicking the Sign button tens of thousands of times! With Lightning Tunnel, you'll pay less than one dollar, click once, then sit back and watch people claim their share.</p>\n\n<p>You can enter the recipients' addresses manually or upload a CSV file and let the program do its job. Lightning Tunnel will also highlight and notify you of wrong addresses in the list, making sure you're not spending on transactions that are doomed to be failed.</p>\n\n<p>The program will automatically generate a redemption link when the bulk transaction is done. You can send this link into your group chat, share it on social sites, or include it in your airdrop results announcement post. Piece of cake!</p>\n\n<p>For the recipients, all you'll have to do is click on the link, press Redeem, and the token's already in your wallet.</p>\n\n<h1>How to use Lightning Tunnel</h1>\n\n<p>So how do you use Lightning Tunnel? Go to Sen Store on <a href=\"https://hub.sentre.io\">https://hub.sentre.io</a>, connect your wallet, install and open Lightning Tunnel, then follow these steps below:</p>\n\n<h2>Step 1. Select token type and input method</h2>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/KIniFu8RgNT0111OpqkWw010q1NGr1pXVB2B79end9NMSKmcL_AShXoQzTQPPb66EmOBASOLDGmvDQNxpb93uMyNEztw6sWpBcp5SpQ0_a2ye1YvUSq7JF__xtlme-N3uCb68ehpvLGZeGxaHg\" alt=\"\"/></figure>\n\n<p>In this step, you can select the type of token you want to do your airdrop with and an input method for the transaction information.</p>\n\n<p>With a small number of recipients, you can enter the information manually. With larger groups, consider bulk import with a CSV file.</p>\n\n<p>When you’re done, press Continue.</p>\n\n<h2>Step 2. Input transaction information</h2>\n\n<h3>Manual Mode</h3>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/Z1pvbYg0svDFtqmKoRdG7FT09qbUowPiH3YrU_m4n8-ERVHY5R_nupJo1yU0DtxdPydGz3NAUczZIfiPjfFGgOdzcX5WjSAHPWq7ReGEO1rOgObpMDnoGMKWL9VXNW1bHvyAKQLpVbShKLEBdw\" alt=\"\"/></figure>\n\n<p>Enter each recipient’s wallet address, and the amount of token you wish to transfer. Then, press OK.</p>\n\n<p>Keep entering addresses and token amounts until the end of your airdrop list. Then, press Continue and go to Step 3.</p>\n\n<h3>Automatic Mode</h3>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/4o6LeBwE_tSjAkblNLk3LTHGs7iR3L9tsHG8BtoL9MvuaLnGUZegSaV0HP1XKC9NIjIaZY-SQ4hbheGhuZmepQYbkOosTcuu1AUM9-I11EItaGcavrB2Zet83RB9wDbjludYJxndBQPDKg9gxw\" alt=\"\"/></figure>\n\n<p>Click to choose the file from your computer, or drop it into the box to upload. Note that Lightning Tunnel only accepts CSV and TXT files.</p>\n\n<p>When you’re done, press Continue.</p>\n\n<h3>Can’t press Continue?</h3>\n\n<p>You may have encountered one of the following problems:</p>\n\n<ul><li>If an address appears more than once, Lightning Tunnel will ask if you want to merge these transactions.</li><li>If there is an invalid address or a missing amount, Lightning Tunnel will highlight it in red. You can fix them directly in manual mode, or select and bulk delete them in automatic mode. You can also cancel the process and upload another file.</li><li>If there are decimals in the amount of token to transfer, be sure to turn on Decimals by pressing on the cog icon (⚙️) on the top right corner.</li></ul>\n\n<h2>Step 3. Confirm and Transfer</h2>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/_x3Gg-6-XXHmVRmPi5sZY_3LI0TRbPijh8x-SZPNCEq6OaQT8MNdGa67EefvOpSNBxu-mZO0SZNB-Gh2codY3GsnRnAjeFT7t4RFF6pC4u41wjTq8r7oH2UiGzqjLx9aE0pfmnXEG-Boaab95g\" alt=\"\"/></figure>\n\n<p>At this step, you can review the total amount of token to transfer, your balance, and the remaining. When you’re done, press Transfer.</p>\n\n<p>Your wallet will ask you to approve twice. The first time is to create a token vault. The second time is to transfer the tokens.</p>\n\n<h2>Step 4. Share the link</h2>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/PhhP05BcdN4EhjwCQzRnv9-_w37T5tfmiqz2NW0zmE5nd8k1YD8abPbqv4LBvl8kDMmPjsJVDJp8-pmsh8K_EEk29kb3iuf48u31p6LyamXLVd1iA8Bhv7_GickgSco_2T6zJABIHoNVEDEOWQ\" alt=\"\"/></figure>\n\n<p>Your tokens are ready to go! Press Share now to create a post with the link on Twitter, or press Copy and send the link into your group chat, share it on other social sites, or include it in your airdrop results announcement post.</p>\n\n<h1>How to receive token from Lightning Tunnel</h1>\n\n<p>When a project sends you an airdrop through Lightning Tunnel, you will receive a redemption link. Clicking on this link will lead you to Sen Hub.</p>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/LD1I2pvIn51EDhIJg4FNET2GhJ7I_eSaGWWBP_92gp0Hn_TmDIEhBaG4b24DuiWbyeTLkFO8j54feszmcTrQxwViARdWEKJxh_LpuDCTQGYjNzJdgugscPtHUkf6M68IjPILFHqf5NsfmHaHMA\" alt=\"\"/></figure>\n\n<p>Press Connect your wallet, or choose from the list of wallets available.</p>\n\n<p>If you’re on the airdrop list, a pop-up will appear. Press Redeem.</p>\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/d5nV10yKcrIeEQd4HN0QvbV5NY1an8lzzuSfWUyJUeP0xLnu0CmoXlzv7PIiZun4zA3hg8cbbXsbCM-c8FywM6xWXtOYODhtmseK2haPqaV7-zXPmTwnYSx8XhA1BrDPm2sdEgnMqvu_8rDq4Q\" alt=\"\"/></figure>\n\n<p>—</p>\n\n<p>Stay tuned for more updates!</p>\n\n<p><a href=\"http://sentre.io/\">Website</a> | <a href=\"https://twitter.com/SentreProtocol\">Twitter</a> | <a href=\"https://discord.gg/VD7UBAp2HN\">Discord</a> | <a href=\"https://t.me/Sentre\">Telegram</a> | <a href=\"http://sentre.medium.com\">Medium</a></p>",
    "title": "Meet Lightning Tunnel: A Bulk Transaction Tool For Airdrops"
  },
  "vn": {
    "title": "",
    "contents": ""
  }
}