{
  "createdAt": 1652348619759,
  "updatedAt": 1652754274130,
  "thumbnail": "https://miro.medium.com/max/1400/1*mtGogBDMwwQeue4opWrz-g.png",
  "category": [
    "user",
    "news",
    "solana"
  ],
  "en": {
    "contents": "We’re back with a boom: Sentre Protocol, Coin98, and Solana Foundation are joining hands in hosting your one and only Coding Camp: Break The Web3 Ice With Solana. This is your golden opportunity to learn the basics of Solana coding, earn quiz prizes, get official graduation NFT, bring home up to 15,000 USD for your DApp, receive a “Web3 Builder” monthly scholarship, and potentially get a blockchain job with Solana’s esteemed partners!\n\nJump right in, the train’s about to depart — Here’s our official timeline for the camp.\n\n# [ REGISTER HERE](https://airtable.com/shrHcq9e0plqg0rIX)\n**Apply before 25th April.**\n\n# The Timeline\n# Phase I: From Zero\nThis phase is a week-long program focusing on blockchain basics and your must-learn tools to start developing on Solana. It’s open to anyone!\n\nHere’s what the curriculum will look like:\n\n1. Blockchain and career opportunities | [5th Apr](https://academy.sentre.io/#/blogs/what-is-blockchain?category=dev)\n2. Building your DApp UI | [8th Apr](https://academy.sentre.io/#/blogs/design-dapp-ui?category=dev)\n3. Managing your DApp state | [11th Apr](https://academy.sentre.io/#/blogs/manage-dapp-state?category=dev)\n4. Your first Solana program | [14th Apr](https://academy.sentre.io/#/blogs/first-solana-program?category=dev)\n5. Using an SPL token program | [17th Apr](https://academy.sentre.io/#/blogs/pda-and-splt-on-solana?category=dev)\n\nLearn in the future with our Web3 experience, provided by Rove. Check out the tutorial videos, educational blogs, and quizzes, and get our exclusive attendance NFT (for everyone joining the space) → [rove.to/solana-vietnam-web3-camp](https://rove.to/solana-vietnam-web3-camp)\n\nSee the instruction video from Rove [here](https://youtu.be/abgSFal3Ovo).\n\n# Phase II: To Hero\nThis phase is a four-week series of 5 workshops focusing on building your first Solana app and analyzing best practices from DeFi, NFT, GameFi, and PriFi (Privacy Finance).\n\nTo provide the best learning experience to our ability, Solana Foundation and Partners will choose 100 participants to join our Coding Camp (calendar invites will be sent prior to the workshops’ dates). These participants can pre-submit their questions and get answers from our workshop mentors during the live session. Make sure you’ve polished your CVs!\n\nNote that you must go through all 5 lessons in the first phase to join the second phase. Here’s the timeline:\n\n1. Let’s build your first Solana application (part 1) | Live on **25th April**\n2. Let’s build your first Solana application (part 2) | Live on **28th April**\n3. Best practice in DeFi | Live on **4th May**\n4. Best practice in GameFi | Live on **10th May**\n5. Best practice in PriFi | Live on **16th May**\n\nHowever, if you can’t access the live workshops — we’ve got you covered! You can wait until the live stream is over — video recordings will be uploaded [here](https://academy.sentre.io/#/blogs?category=dev), along with the quizzes.\n\n# Phase III: Welcome to the Web3 World\nYou’ve learned the basics of Solana, and now it’s time to put your knowledge to practice. Form your team and build your own DApp with us!\n\nStart finding the team members and preparing for your final assignment: Building your own DApp. The timeline will look like this:\n\n*  DApp building period: 17–28th May\n*  Demo Day — Present your DApp: 30th May\n*  Winner announcement: 2nd June\n\nThe following rules will be applied:\n\n* You can submit a new DApp, or previous work (if any).\n* You can participate as an independent participant, or as a team.\n* You have to go through our 10-lesson course to participate in the Demo Day.\n* **Knowledge of both Vietnamese (native) and English (basic) is required** — International judges will be present on Demo Day!\n\nSubmissions are due on **28th May, 23:59 GMT+7** → Submit [here](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9).\n\nWe will also be hosting a series of non-technical workshops. Details will be provided via email and our [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1) to all the individuals that registered for the Coding Camp.\n\n# The Prizes and Rewards\nWe believe that Web3 is a world full of learn-to-earn opportunities, and we want to make sure our participants get to experience it first-hand.\n\nThere will be prizes and rewards for every selected participant:\n\n# Quiz Prizes\n**Of our 100 camp participants**, those who take part in the quizzes and get 100% correct answers will earn quiz prizes from us! Each participant will be eligible to win up to $100 as quiz prizes.\n\n# Credits, Certificates, and Scholarships\nOf our 100 camp participants, those who join in at least 3 live workshops, take part in all quizzes, and participate in the Demo Day will be awarded Solana Foundation’s exclusive certificate NFTs.\n\n10 outstanding learners with extraordinary results will be hand-picked by the Solana Foundation and Partners to grant:\n\n* An honorary scholarship worth $1,000 USD per month for three consecutive months from Solana Foundation\n* 5,000 credits from Amazon Web Services (AWS)\n# Camp Hero Rewards\nFrom the participants of the Demo Day, three camp heroes will be selected by our panel of Judges to receive the following rewards:\n\n* The Golden Hero: $15,000 USD from Solana Foundation & 10,000 credits from AWS\n* The Silver Hero: $10,000 USD from Solana Foundation & 10,000 credits from AWS\n* The Bronze Hero: $5,000 USD from Solana Foundation & 10,000 credits from AWS\n# Registration Link\n[Sign up](https://airtable.com/shrHcq9e0plqg0rIX) for updates about our workshop series — Phase II. Apply before 25th April.\n\n[Apply and submit your DApp](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9) for our final assignment — Phase III. Deadline to apply: 28th May, 23:59 (GMT+7).\n\n# Questions\nIf you have any questions, please email: hi@sentre.io or reach us through our [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1).\n\n# About Solana\n\nSolana is an open-source project implementing a new, high-performance, permissionless blockchain. It’s built to enable scalable, user-friendly apps for the world. [Read more about Solana](https://solana.com/).\n\n# About Sentre Protocol\n[Sentre Protocol](https://sentre.io/#/home) is an All-in-One Solana Open Platform with a DApp Store and Universal Protocol for Liquidity, where:\n\n* Users can install their favorite DApps and experience the entire DeFi world on a single platform;\n* Developers and partners can deliver DApps through Sen Store, fully use available resources and contribute to the platform with no restrictions.\n\n# About Coin98\nCoin98 is the #1 crypto super-app designed to seamlessly connect a billion users to the crypto world safely and securely.\n\nWe offer users a comprehensive and trusted ecosystem of essential services across the globe, including a non-custodial, multi-chain NFT & cryptocurrency wallet, built-in DEXs, Cross-chain Bridge & DApp Browser, a powerful Terminal, attractive Earn, Gift & Campaign, and Others.\n\n# About Rove\nRove empowers anyone to build a presence in the new 3D web — a network of 3D websites that are immersive, real-time, and persistent. Creating interactive 3D/VR environments is as simple as applying a website template. Every template can be customized to the creator’s liking — all drag and drop, no code required.\n\nRove is tomorrow’s Shopify — it takes just a few minutes to build a 3D store for your customers. Rove is Behance for the future — build a 3D gallery for clients and level up your portfolio. Rove is WordPress for Web3. Turn your personal website into a 3D home where people can meet with you in person.\n\nRove is for anyone with a vision! Go to [rove.to](https://rove.to/) to create your own 3D space and invite your friends!",
    "title": "Sentre x Solana x Coin98 Collab On “Coding Camp: Break The Web3 Ice With Solana”"
  },
  "vn": {
    "title": "",
    "contents": ""
  },
  "id": "897967347413"
}