{
  "createdAt": 1652348619759,
  "updatedAt": 1652759673078,
  "thumbnail": "https://miro.medium.com/max/1400/1*mtGogBDMwwQeue4opWrz-g.png",
  "category": [
    "user",
    "news",
    "solana"
  ],
  "en": {
    "contents": "We’re back with a boom: Sentre Protocol, Coin98, and Solana Foundation are joining hands in hosting your one and only Coding Camp: Break The Web3 Ice With Solana. This is your golden opportunity to learn the basics of Solana coding, earn quiz prizes, get official graduation NFT, bring home up to 15,000 USD for your DApp, receive a “Web3 Builder” monthly scholarship, and potentially get a blockchain job with Solana’s esteemed partners!\n\nJump right in, the train’s about to depart — Here’s our official timeline for the camp.\n\n# [REGISTER HERE](https://airtable.com/shrHcq9e0plqg0rIX)\n**Apply before 25th April**\n\n# The Timeline\n# Phase I: From Zero\nThis phase is a week-long program focusing on blockchain basics and your must-learn tools to start developing on Solana. It’s open to anyone!\n\nHere’s what the curriculum will look like:\n\n1. Blockchain and career opportunities | [5th Apr](https://academy.sentre.io/#/blogs/what-is-blockchain?category=dev)\n2. Building your DApp UI | [8th Apr](https://academy.sentre.io/#/blogs/design-dapp-ui?category=dev)\n3. Managing your DApp state | [11th Apr](https://academy.sentre.io/#/blogs/manage-dapp-state?category=dev)\n4. Your first Solana program | [14th Apr](https://academy.sentre.io/#/blogs/first-solana-program?category=dev)\n5. Using an SPL token program | [17th Apr](https://academy.sentre.io/#/blogs/pda-and-splt-on-solana?category=dev)\n\nLearn in the future with our Web3 experience, provided by Rove. Check out the tutorial videos, educational blogs, and quizzes, and get our exclusive attendance NFT (for everyone joining the space) → [rove.to/solana-vietnam-web3-camp](https://rove.to/solana-vietnam-web3-camp)\n\nSee the instruction video from Rove [here](https://youtu.be/abgSFal3Ovo).\n\n# Phase II: To Hero\nThis phase is a four-week series of 5 workshops focusing on building your first Solana app and analyzing best practices from DeFi, NFT, GameFi, and PriFi (Privacy Finance).\n\nTo provide the best learning experience to our ability, Solana Foundation and Partners will choose 100 participants to join our Coding Camp (calendar invites will be sent prior to the workshops’ dates). These participants can pre-submit their questions and get answers from our workshop mentors during the live session. Make sure you’ve polished your CVs!\n\nNote that you must go through all 5 lessons in the first phase to join the second phase. Here’s the timeline:\n\n1. Let’s build your first Solana application (part 1) | Live on **25th April**\n2. Let’s build your first Solana application (part 2) | Live on **28th April**\n3. Best practice in DeFi | Live on **4th May**\n4. Best practice in GameFi | Live on **10th May**\n5. Best practice in PriFi | Live on **16th May**\n\nHowever, if you can’t access the live workshops — we’ve got you covered! You can wait until the live stream is over — video recordings will be uploaded [here](https://academy.sentre.io/#/blogs?category=dev), along with the quizzes.\n\n# Phase III: Welcome to the Web3 World\nYou’ve learned the basics of Solana, and now it’s time to put your knowledge to practice. Form your team and build your own DApp with us!\n\nStart finding the team members and preparing for your final assignment: Building your own DApp. The timeline will look like this:\n\n*  DApp building period: 17–28th May\n*  Demo Day — Present your DApp: 30th May\n*  Winner announcement: 2nd June\n\nThe following rules will be applied:\n\n* You can submit a new DApp, or previous work (if any).\n* You can participate as an independent participant, or as a team.\n* You have to go through our 10-lesson course to participate in the Demo Day.\n* **Knowledge of both Vietnamese (native) and English (basic) is required** — International judges will be present on Demo Day!\n\nSubmissions are due on **28th May, 23:59 GMT+7** → Submit [here](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9).\n\nWe will also be hosting a series of non-technical workshops. Details will be provided via email and our [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1) to all the individuals that registered for the Coding Camp.\n\n# The Prizes and Rewards\nWe believe that Web3 is a world full of learn-to-earn opportunities, and we want to make sure our participants get to experience it first-hand.\n\nThere will be prizes and rewards for every selected participant:\n\n# Quiz Prizes\n**Of our 100 camp participants**, those who take part in the quizzes and get 100% correct answers will earn quiz prizes from us! Each participant will be eligible to win up to $100 as quiz prizes.\n\n# Credits, Certificates, and Scholarships\nOf our 100 camp participants, those who join in at least 3 live workshops, take part in all quizzes, and participate in the Demo Day will be awarded Solana Foundation’s exclusive certificate NFTs.\n\n10 outstanding learners with extraordinary results will be hand-picked by the Solana Foundation and Partners to grant:\n\n* An honorary scholarship worth $1,000 USD per month for three consecutive months from Solana Foundation\n* 5,000 credits from Amazon Web Services (AWS)\n# Camp Hero Rewards\nFrom the participants of the Demo Day, three camp heroes will be selected by our panel of Judges to receive the following rewards:\n\n* The Golden Hero: $15,000 USD from Solana Foundation & 10,000 credits from AWS\n* The Silver Hero: $10,000 USD from Solana Foundation & 10,000 credits from AWS\n* The Bronze Hero: $5,000 USD from Solana Foundation & 10,000 credits from AWS\n# Registration Link\n[Sign up](https://airtable.com/shrHcq9e0plqg0rIX) for updates about our workshop series — Phase II. Apply before 25th April.\n\n[Apply and submit your DApp](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9) for our final assignment — Phase III. Deadline to apply: 28th May, 23:59 (GMT+7).\n\n# Questions\nIf you have any questions, please email: hi@sentre.io or reach us through our [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1).\n\n# About Solana\n\nSolana is an open-source project implementing a new, high-performance, permissionless blockchain. It’s built to enable scalable, user-friendly apps for the world. [Read more about Solana](https://solana.com/).\n\n# About Sentre Protocol\n[Sentre Protocol](https://sentre.io/#/home) is an All-in-One Solana Open Platform with a DApp Store and Universal Protocol for Liquidity, where:\n\n* Users can install their favorite DApps and experience the entire DeFi world on a single platform;\n* Developers and partners can deliver DApps through Sen Store, fully use available resources and contribute to the platform with no restrictions.\n\n# About Coin98\nCoin98 is the #1 crypto super-app designed to seamlessly connect a billion users to the crypto world safely and securely.\n\nWe offer users a comprehensive and trusted ecosystem of essential services across the globe, including a non-custodial, multi-chain NFT & cryptocurrency wallet, built-in DEXs, Cross-chain Bridge & DApp Browser, a powerful Terminal, attractive Earn, Gift & Campaign, and Others.\n\n# About Rove\nRove empowers anyone to build a presence in the new 3D web — a network of 3D websites that are immersive, real-time, and persistent. Creating interactive 3D/VR environments is as simple as applying a website template. Every template can be customized to the creator’s liking — all drag and drop, no code required.\n\nRove is tomorrow’s Shopify — it takes just a few minutes to build a 3D store for your customers. Rove is Behance for the future — build a 3D gallery for clients and level up your portfolio. Rove is WordPress for Web3. Turn your personal website into a 3D home where people can meet with you in person.\n\nRove is for anyone with a vision! Go to [rove.to](https://rove.to/) to create your own 3D space and invite your friends!",
    "title": "Sentre x Solana x Coin98 Collab On “Coding Camp: Break The Web3 Ice With Solana”"
  },
  "vn": {
    "contents": "Tin nóng: Sentre Protocol, Coin98 và Solana Foundation đã quyết định hợp tác đồng tổ chức chương trình **Coding Camp: Phá Băng Web3** Với Solana! Đây là cơ hội ngàn vàng để bạn nắm vững những kiến thức cơ bản về lập trình trên Solana, kiếm thưởng trên mỗi bài tập, nhận chứng chỉ bằng NFT chính thức, mang về giải thưởng lên đến 15,000 đô cho DApp của mình, giành học bổng “Web3 Builder” hàng tháng, và có cơ hội làm việc trong thị trường Blockchain với các đối tác hàng đầu của Solana!\n\nLên đường thôi — Timeline của chương trình đây rồi:\n\n# [ĐĂNG KÝ NGAY](https://airtable.com/shrHcq9e0plqg0rIX)\n**Vui lòng nộp đơn trước 25/4/2022**\n\n# Timeline chương trình\n# Phần I: From Zero\nĐây là một chương trình 7 ngày tập trung vào việc truyền tải các kiến thức cơ bản về blockchain, và các công cụ bạn cần nắm vững để bắt đầu lập trình trên Solana. Ai cũng có thể tham gia!\n\nCác nội dung của chương trình bao gồm:\n\n1. Blockchain và cơ hội ngành | [5/4](https://academy.sentre.io/#/blogs/what-is-blockchain?category=dev)\n2. Thiết kế UI DApp cơ bản | [8/4](https://academy.sentre.io/#/blogs/design-dapp-ui?category=dev)\n3. Quản lý State của DApp | [11/4](https://academy.sentre.io/#/blogs/manage-dapp-state?category=dev)\n4. Viết phần mềm Solana đầu tiên | [14/4](https://academy.sentre.io/#/blogs/first-solana-program?category=dev)\n5. SPL token program | [17/4](https://academy.sentre.io/#/blogs/pda-and-splt-on-solana?category=dev)\n\nTrải nghiệm học tập trong thế giới tương lai ngay từ bây giờ với không gian Web3 do Rove cung cấp. Xem video hướng dẫn, các bài viết giáo dục, bộ câu hỏi bài tập, và lấy **chứng nhận tham gia bằng NFT** độc quyền từ chúng tôi (dành cho những ai tới thăm không gian học tập này) → rove.to/solana-vietnam-web3-camp\n\nXem video hướng dẫn từ Rove [tại đây](https://youtu.be/abgSFal3Ovo).\n\n# Phần II: To Hero\nĐây là một chuỗi 5 workshop kéo dài 4 tuần, tập trung vào việc hướng dẫn thực hành xây dựng DApp trên Solana và phân tích các cơ chế liên quan đến DeFi, NFT, GameFi, và PriFi (Privacy Finance).\n\nĐể mang lại trải nghiệm học tập tốt nhất cho các bạn trong khả năng của mình, **Solana Foundation và các Đối tác** sẽ lựa chọn 100 cá nhân tham dự Coding Camp (đường link tham gia các buổi workshop sẽ được gửi tới email của từng người trước ngày tổ chức). Những cá nhân này sẽ được gửi câu hỏi tới ban tổ chức trước khi tham dự, và nhận câu trả lời từ các mentor của chương trình trong buổi workshop. Hãy chuẩn bị CV thật chỉn chu bạn nhé!\n\nNote that you must go through all 5 lessons in the first phase to join the second phase. Here’s the timeline:\n\n1. Bắt tay xây dựng DApp đầu tiên trên Solana (phần 1) | Ngày **25/5**\n2. Bắt tay xây dựng DApp đầu tiên trên Solana (phần 2) | Ngày **28/5**\n3. Ví dụ kinh điển trong DeFi | Ngày **4/5**\n4. Ví dụ kinh điển trong GameFi | Ngày **10/5**\n5. Ví dụ kinh điển trong PriFi | Ngày **16/5**\n\nTuy nhiên, nếu bạn không thể xem được các buổi live workshop này — đừng lo! Bạn có thể đợi đến khi live stream kết thúc — các bản ghi lại sẽ được tải lên [tại đây](https://academy.sentre.io/#/blogs?category=dev), cùng với phần bài tập.\n\n# Phần III: Chào mừng đến thế giới Web3\nBạn đã nắm được căn bản về lập trình trên Solana, và giờ là lúc để thực hành những kiến thức đã học. Lập nhóm và xây dựng DApp thôi!\n\nHãy bắt tay vào tìm kiếm đồng đội và chuẩn bị cho bài tập cuối chương trình: Xây dựng DApp riêng của bạn. Timeline chương trình như sau:\n\n*  Thời gian xây dựng DApp: 17–28/5\n*  Demo Day — Thuyết trình về DApp của bạn: 30/5\n*  Thông báo kết quả chung cuộc: 2/6\n\nQuy định chung:\n\n* Bạn có thể nộp một DApp hoàn toàn mới, hoặc một sản phẩm đã thực hiện từ trước (nếu có).\n* Bạn có thể tham gia theo hình thức cá nhân hoặc theo nhóm.\n* Bạn phải tham gia đủ 10 nội dung bài học để đạt điều kiện tham gia Demo Day.\n* **Trình độ tiếng Việt (bản ngữ) và tiếng Anh (cơ bản) là yêu cầu bắt buộc.** Sẽ có các giám khảo ngoại quốc tham gia trong Demo Day!\n\n**Bài dự thi cần được nộp không muộn hơn ngày 28/5/2022, 23:59 GMT+7 → Nộp bài [tại đây](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9).**\n\nChúng tôi cũng sẽ tổ chức một series workshop không đi sâu vào kỹ thuật. Chi tiết sẽ được gửi qua email và [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1) của chúng tôi, tới tất cả các cá nhân đã đăng ký tham gia Coding Camp.\n\n# Phần quà và Giải thưởng\nChúng tôi tin rằng Web3 là một thế giới tràn đầy những cơ hội để learn-to-earn, và chúng tôi muốn đảm bảo rằng các cá nhân tham gia sẽ được trải nghiệm thế giới này trước tiên.\n\nTất cả những ai được lựa chọn tham gia chương trình đều sẽ có quà tặng và giải thưởng\n\n# Quiz Prizes\n**Trong số 100 cá nhân tham gia chương trình**, những bạn làm bài tập và đạt 100% câu trả lời đúng sẽ nhận được phần thưởng trên mỗi bài tập từ chúng tôi! Mỗi cá nhân có thể nhận tổng cộng lên tới 100 đô!\n\n# Credit, Chứng chỉ, và Học bổng\n**Trong số 100 cá nhân tham gia chương trình**, những bạn tham gia ít nhất 3 buổi workshop, hoàn thành tất cả các bài tập, và tham gia vào buổi Demo Day sẽ được trao tặng Chứng chỉ bằng NFT độc quyền từ Solana Foundation.\n\n10 cá nhân xuất sắc với kết quả học tập tốt nhất sẽ được Solana Foundation và Đối tác lựa chọn để trao tặng:\n\n* Học bổng trị giá 1000 đô mỗi tháng trong vòng 3 tháng liên tiếp từ Solana Foundation.\n* 5,000 credit từ Amazon Web Services (AWS)\n# Giải Thưởng Camp Hero\nTừ các đội nhóm và cá nhân tham gia Demo Day, ba Camp Hero sẽ được hội đồng giám khảo lựa chọn để trao tặng các giải thưởng sau:\n\n* The Golden Hero: $15,000 từ Solana Foundation & 10,000 credit từ AWS\n* The Silver Hero: $10,000 từ Solana Foundation & 10,000 credit từ AWS\n* The Bronze Hero: $5,000 từ Solana Foundation & 10,000 credit từ AWS\n# Đường link đăng ký\n[Đăng ký](https://airtable.com/shrHcq9e0plqg0rIX) để nhận thông tin về Phần II của chương trình. Vui lòng nộp đơn trước 25/4/2022.\n\n[Đăng ký và nộp dự án ](https://g9c7s73vd7n.typeform.com/to/qZoT3Mg9) DApp của bạn cho bài tập cuối chương trình (Phần III). Thời hạn nộp bài: 28/5/2022, 23:59 (GMT+7).\n\n# Ý kiến và thắc mắc\nNếu có câu hỏi dành cho chúng tôi, vui lòng gửi tới email: hi@sentre.io hoặc liên hệ với chúng tôi thông qua [Telegram channel](https://t.me/+xG3yLK_wqlplMzY1).\n\n# Về Solana\n\nSolana là một dự án mã nguồn mở áp dụng công nghệ blockchain mới, hiệu suất cao và không cần cho phép (permissionless). Solana ra đời để giúp các ứng dụng thân thiện với người dùng, có thể mở rộng được áp dụng trên toàn cầu. Đọc thêm về [Solana](https://solana.com/).\n\n# Về Sentre Protocol\n[Sentre Protocol](https://sentre.io/#/home) là nền tảng mở All-in-One hoạt động trên mạng lưới Solana, cung cấp DApp Store và giao thức mở giúp tích lũy thanh khoản. Với Sentre:\n\n* Người dùng có thể cài đặt các DApp yêu thích của mình và trải nghiệm thế giới DeFi trên một nền tảng duy nhất.\n* Lập trình viên và đối tác có thể phát hành DApp thông qua Sen Store, tận dụng tài nguyên có sẵn và tự do đóng góp cho nền tảng.\n\n# Về Coin98\nCoin98 là siêu ứng dụng tiền điện tử số 1, được thiết kế để kết nối liền mạch hàng tỷ người dùng với thế giới tiền điện tử một cách an toàn và bảo mật.\n\nChúng tôi cung cấp cho người dùng một hệ sinh thái toàn diện và đáng tin cậy với các dịch vụ thiết yếu trên toàn cầu, bao gồm ví NFT & tiền điện tử trên multi-chain và không bị giám sát, tích hợp DEX, Cross-chain Bridge & DApp Browser, một Terminal mạnh mẽ, các Phần thưởng, Quà tặng, Chiến dịch hấp dẫn, và hơn thế nữa.\n\n# Về Rove\nRove giúp mọi người tạo ra một trang web 3D/VR dễ dàng bằng cách sử dụng các template khác nhau. Chỉ với một cú click, người dùng có thể tùy chỉnh, trang trí trang web 3D theo sở thích của mình bằng thao tác kéo — thả mà không cần phải biết lập trình.\n\nRove là một phiên bản nâng cấp của Shopify — chỉ mất vài phút để xây dựng một gian hàng online 3D, một phòng triển lãm tranh 3D hoặc đơn giản chỉ là một trang web cá nhân của bạn trên môi trường 3D, nơi mà bất cứ ai cũng có thể ghé thăm và trò chuyện cùng bạn.\n\nTruy cập [rove.to](https://rove.to/) để tạo không gian 3D cho riêng mình và mời bạn bè ngay!",
    "title": "Sentre x Solana x Coin98 hợp tác với “Coding Camp: Phá Băng Web3 Với Solana”"
  },
  "id": "897967347413"
}